scratch/tmp/pytest-of-Micha/pytest-0/test_pressure_conversion_and_c0/case/constant/turbulenceProperties
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object turbulenceProperties;
}
simulationType RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }
