scratch/tmp/pytest-of-Micha/pytest-0/test_pressure_conversion_and_c0/case/0/nut
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
inlet { type calculated; value uniform 0; }
outlet { type calculated; value uniform 0; }
front { type calculated; value uniform 0; }
back { type calculated; value uniform 0; }
ground { type calculated; value uniform 0; }
top { type calculated; value uniform 0; }
sphere_0 { type nutkWallFunction; value uniform 0; }
}
